tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Image manipulation library
brew "jpeg"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# Improved top (interactive process viewer)
brew "htop"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Object-relational database system
brew "postgresql"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Dumb downloader that scrapes the web
brew "you-get"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Menu bar icon organizer
cask "bartender"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Screen and video recording software
cask "loom"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# App to write, plan, collaborate, and get organized
cask "notion"
# PDF compression tool
cask "pdf-squeezer"
# React client for Simplenote
cask "simplenote"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
