tap "homebrew/bundle"
tap "homebrew/services"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Development kit for the Java programming language
brew "openjdk"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Alternative to top/htop
brew "glances"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# Dex to Java decompiler
brew "jadx"
# Image manipulation library
brew "jpeg", link: true
# Kubernetes command-line interface
brew "kubernetes-cli"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Object-relational database system
brew "postgresql@14"
# Emulator for x86 and PowerPC
brew "qemu"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Dumb downloader that scrapes the web
brew "you-get"
# Apple TV Aerial screensaver
cask "aerial"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Menu bar icon organizer
cask "bartender"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Screen and video recording software
cask "loom"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Clipboard manager
cask "maccy"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop virtualization software
cask "parallels"
# PDF compression tool
cask "pdf-squeezer"
# IDE for professional Python development
cask "pycharm"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# JavaScript IDE
cask "webstorm"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "Adobe Lightroom", id: 1451544217
mas "Be Focused", id: 973134470
mas "Dashlane", id: 517914548
mas "DevCleaner", id: 1388020431
mas "Gifski", id: 1351639930
mas "GoodNotes", id: 1444383602
mas "Hotspot Shield", id: 771076721
mas "HP Smart", id: 1474276998
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 360593530
mas "Prime Video", id: 545519333
mas "SnippetsLab", id: 1006087419
mas "The Unarchiver", id: 425424353
mas "Xnip", id: 1221250572
vscode "076923.python-image-preview"
vscode "aaron-bond.better-comments"
vscode "batisteo.vscode-django"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.vscode-mysql"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.winteriscoming"
vscode "keroc.hex-fmt"
vscode "KevinRose.vsc-python-indent"
vscode "LeonardSSH.vscord"
vscode "mathiasfrohlich.Kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "patbenatar.advanced-new-file"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "raidou.calc"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WallabyJs.quokka-vscode"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"